CSI API ETABS v1
cPropRebar.GetRebarPropsWithGUID Method
 Retrieves dimension data and GUID for a rebar property
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetRebarPropsWithGUID(
	string Name,
	ref double Area,
	ref double Diameter,
	ref string MyGUID
)
Function GetRebarPropsWithGUID (
	Name As String,
	ByRef Area As Double,
	ByRef Diameter As Double,
	ByRef MyGUID As String
) As Integer
Dim instance As cPropRebar
Dim Name As String
Dim Area As Double
Dim Diameter As Double
Dim MyGUID As String
Dim returnValue As Integer
returnValue = instance.GetRebarPropsWithGUID(Name,
	Area, Diameter, MyGUID)
int GetRebarPropsWithGUID(
	String^ Name,
	double% Area,
	double% Diameter,
	String^% MyGUID
)
abstract GetRebarPropsWithGUID :
        Name : string *
        Area : float byref *
        Diameter : float byref *
        MyGUID : string byref -> int
Parameters
Name
Type: System.String
 The name of an existing rebar property
Area
Type: System.Double
Diameter
Type: System.Double
MyGUID
Type: System.String
Return Value
Type: Int32
 Returns zero if the data is successfully retrieved, otherwise it returns nonzero
Remarks
See Also
Reference
cPropRebar Interface
ETABSv1 Namespace